#### OBJExportOptions Class

---

|  |
| --- |
| Members   See Also |

The export options used by exporting to OBJ file format.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2023

# Syntax

| C# |
| --- |
| ``` public class OBJExportOptions : ATFBaseExportOptions ``` |

| Visual Basic |
| --- |
| ``` Public Class OBJExportOptions _ 	Inherits ATFBaseExportOptions ``` |

| Visual C++ |
| --- |
| ``` public ref class OBJExportOptions : public ATFBaseExportOptions ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB ATFBaseExportOptions
  Autodesk.Revit.DB OBJExportOptions

# See Also

OBJExportOptions Members

Autodesk.Revit.DB Namespace